consultorio/app/models/appointment.rb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."date" = ? AND "appointments"."professional_id" = ? ORDER BY "appointments"."id" ASC LIMIT ?  [["date", "2021-11-25 21:42:00"], ["professional_id", 2], ["LIMIT", 1]]
---
  def valid_uniqueness?
    if Appointment.where(date:self.date, professional_id:self.professional_id).first