consultorio/app/models/grid.rb

    def valid_professional?
        if self.professional.nil? || Professional.where(id:self.professional).first
---
SELECT "professionals".* FROM "professionals" WHERE "professionals"."id" = ? ORDER BY "professionals"."id" ASC LIMIT ?  [["id", 8], ["LIMIT", 1]]

    def export_daily
      schedule=Appointment.schedule
      if professional.nil?
        appointments=Appointment.where("strftime('%Y-%m-%d', date) = ?", self.day)
      else
        appointments=Appointment.where("strftime('%Y-%m-%d', date) = ? and professional_id=?", self.day, self.professional )
---
SELECT "appointments".* FROM "appointments" WHERE (strftime('%Y-%m-%d', date) = '2021-11-25')
SELECT "appointments".* FROM "appointments" WHERE (strftime('%Y-%m-%d', date) = '2021-12-25' and professional_id='8')
SELECT "professionals".* FROM "professionals" WHERE "professionals"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

      def export_weekly
        schedule=Appointment.schedule
        week=Grid.get_week(self.day)
        semana=%w[lunes martes miercoles jueves viernes sabado]
        if professional.nil?
          appointments=Appointment.where("strftime('%Y-%m-%d', date) = ?", week[0]).or(Appointment.where("strftime('%Y-%m-%d', date) = ?", week[1]).or(Appointment.where("strftime('%Y-%m-%d', date) = ?", week[2]).or(Appointment.where("strftime('%Y-%m-%d', date) = ?", week[3]).or(Appointment.where("strftime('%Y-%m-%d', date) = ?", week[4]).or(Appointment.where("strftime('%Y-%m-%d', date) = ?", week[5]))))))
        else
          appointments=Appointment.where("strftime('%Y-%m-%d', date) = ? and professional_id=?", week[0], self.professional).or(Appointment.where("strftime('%Y-%m-%d', date) = ? and professional_id=?", week[1], self.professional).or(Appointment.where("strftime('%Y-%m-%d', date) = ? and professional_id=?", week[2], self.professional).or(Appointment.where("strftime('%Y-%m-%d', date) = ? and professional_id=? ", week[3], self.professional).or(Appointment.where("strftime('%Y-%m-%d', date) = ? and professional_id=?", week[4], self.professional).or(Appointment.where("strftime('%Y-%m-%d', date) = ? and professional_id=?", week[5], self.professional))))))
---
SELECT "appointments".* FROM "appointments" WHERE (strftime('%Y-%m-%d', date) = '2021-11-25')
SELECT "professionals".* FROM "professionals" WHERE "professionals"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]