consultorio/app/views/grids/new.html.erb

SELECT "professionals".* FROM "professionals" ORDER BY "professionals"."name" ASC
---
      <%= form.label :professional %><br>
      <%= form.collection_select :professional_id, Professional.order(:name), :id, :name %>