consultorio/app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments" WHERE (professional_id==1) ORDER BY "appointments"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @appointments = @professional.appointments.all

INSERT INTO "appointments" ("date", "name", "professional_id", "surname", "phone", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @appointment = @professional.appointments.new(appointment_params)

    if @appointment.save

UPDATE "appointments" SET "date" = ?, "surname" = ?, "updated_at" = ? WHERE "appointments"."id" = ?  [["date", "2021-12-12 12:00:00"], ["surname", "Bonavita"], ["updated_at", "2021-11-17 12:30:06.945362"], ["id", 1]]
---
  def update
    if @appointment.update(appointment_params)

SELECT "appointments".* FROM "appointments" WHERE "appointments"."professional_id" = ?  [["professional_id", 10]]
---
  def cancel_all
    @professional.appointments.all.each do

SELECT "professionals".* FROM "professionals" WHERE "professionals"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
    def set_professional
      @professional = Professional.find(params[:professional_id])