consultorio/app/controllers/appointments_controller.rb

DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 1]]
---
  def cancel_all
    @professional.appointments.destroy_all