consultorio/app/controllers/professionals_controller.rb

SELECT "professionals".* FROM "professionals"
---
    def index
        @professionals=Professional.all

INSERT INTO "professionals" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Damian Ferrero"], ["created_at", "2021-11-16 18:47:27.041212"], ["updated_at", "2021-11-16 18:47:27.041212"]]
---
    def create #arreglar
        if @professional=Professional.create(name: params[:professional][:name]).valid?

UPDATE "professionals" SET "name" = ?, "updated_at" = ? WHERE "professionals"."id" = ?  [["name", "mARTINA Baez"], ["updated_at", "2021-11-15 15:11:03.205596"], ["id", 3]]
---
    def update
        if @professional.update(name: params[:professional][:name])

SELECT "appointments".* FROM "appointments" WHERE (professional_id==1) ORDER BY "appointments"."id" ASC LIMIT ?  [["LIMIT", 1]]
DELETE FROM "professionals" WHERE "professionals"."id" = ?  [["id", 1]]
---
    def destroy
        if not Appointment.where("professional_id==#{@professional.id}").first
            @professional.destroy

SELECT "appointments".* FROM "appointments" WHERE (professional_id==1)
---
    def show
        @appointments= Appointment.where("professional_id==#{@professional.id}")

SELECT "professionals".* FROM "professionals" WHERE "professionals"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
    def find_professional
        @professional=Professional.find(params[:id])