consultorio/app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "encrypted_password" = ?, "updated_at" = ?, "role" = ? WHERE "users"."id" = ?  [["encrypted_password", "$2a$12$ZFEDhEE0QTAepaxDMovly.VIPYIitMcvLHNOwSQETF.2.Tw.DnPFG"], ["updated_at", "2021-12-06 12:16:08.628868"], ["role", 2], ["id", 6]]