consultorio/app/controllers/users_controller.rb

  def create
    pass= params[:user][:password]
    role= params[:user][:role]
    email= params[:user][:email]
    puts pass
    puts role.class
    puts role
    puts email
    role=role.to_i
    @user = User.new(email:email,password:pass,role:role)

    if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def update
    pass= params[:user][:password]
    role= params[:user][:role]
    email= params[:user][:email]
    puts pass
    puts role.class
    puts role
    puts email
    role=role.to_i
    if @user.update(email:email,password:pass,role:role)
---
UPDATE "users" SET "encrypted_password" = ?, "updated_at" = ?, "role" = ? WHERE "users"."id" = ?  [["encrypted_password", "$2a$12$H1n1wdGFTrGl/K19MOL6levfTZKzLlyFnuUhVAuex/nnXC6BVIfE."], ["updated_at", "2021-12-02 20:50:22.563955"], ["role", 0], ["id", 3]]